Repository: mennaMohamedY/todo_app_flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

# appBarTitle
source: To Do List
ar: قائمه المهام

# list
source: to Do List
ar: القائمه

source: settings
ar: الاعدادات

# addTask
source: Add new Task
ar: اضافه مهمه

# taskTitle
source: Enter Your Task Title
ar: ادخل عنوان المهمه

# taskDescription
source: Enter Your Task Description
ar: ادخل تفاصيل المهمه

source: Select Time
ar: اختار الوقت

# addTaskBtn
source: Add Task
ar: اضافه المهمه

source: Language
ar: اللغه

source: Mode
ar: الوضع

source: English
ar: الانجليزيه

source: Arabic
ar: العربيه

source: Dark
ar: مظلم

source: Light
ar: مضء

source: Edit Task
ar: تعديل مهمه

source: Save Changes
ar: احفظ التعديلات

# titleStateError
source: Task Title is required!
ar: يجب ادخال عنوان المهمه!

# descriptionStateError
source: Task Description is required!
ar: يجب ادخال تفاصيل المهمه!

# taskStateError
source: This field is required!
ar: برجاء ادخال المهمه

source: Task Added to firestore!
ar: !تم اضافه المهمه

source: Task Deleted!
ar: تم حذف المهمه!

# taskEdited
source: Task Edited Successfully!
ar: تم تعديل المهمه !

# taskTimeEdited
source: Task Time Changed Successfully!
ar: تم تغيير وقت المهمه !!

source: Login
ar: دخول

source: Register
ar: تسجيل دخول

source: Your Name
ar: الاسم

# yourNameError
source: This Field can't be empty!
ar: برجاء ادخال كلمه اسمك!

source: Email
ar: البريد الالكتروني

# invalidEmail
source: Invalid Email Address
ar: بريد الكترون غير صحيح

source: Password
ar: كلمه السر

# passwordError
source: This Field can't be empty!
ar: برجاء ادخال كلمه السر!

source: Confirm Password!
ar: برجاء اعاده ادخال كلمه السر!

# confirmPasswordError
source: password mismatch!
ar: كلمه مرور غير متطابقه!

source: Get Started
ar: أبدا الان

source: Create Account!
ar: انشاء حساب!

source: Task Organizer
ar: منظم المهام

# appOverView
source: Quick Organizer,Easy to share simple to use
ar: منطم سريع , سهل الاستخدام سهل المشاركه

# emailError
source: Email is required!
ar: يجب ادخال البريد الالكتروني!
